Kolodieiev/perfect_console/firmware/esp32s3_fw/src/meow/driver/graphics/TFT_eSPI/TFT_eSPI.h
/***************************************************
  Arduino TFT graphics library targeted at ESP8266
  and ESP32 based boards.

  This is a stand-alone library that contains the
  hardware driver, the graphics functions and the
  proportional fonts.

  The built-in fonts 4, 6, 7 and 8 are Run Length
  Encoded (RLE) to reduce the FLASH footprint.

  Last review/edit by Bodmer: 04/02/22
 ****************************************************/

// Stop fonts etc being loaded multiple times
#pragma once
#pragma GCC optimize("O3")

#define TFT_ESPI_VERSION "2.5.30"

// Bit level feature flags
// Bit 0 set: viewport capability
#define TFT_ESPI_FEATURES 1

/***************************************************************************************
**                         Section 1: Load required header files
***************************************************************************************/

// Standard support
#include <Arduino.h>
#include <Print.h>
#include <SPI.h>
#include <hal/spi_types.h>

/***************************************************************************************
**                         Section 2: Load library and processor specific header files
***************************************************************************************/

#include "./User_Setup_Select.h"

// Include the processor specific drivers
#if defined(CONFIG_IDF_TARGET_ESP32S3)
#include "Processors/TFT_eSPI_ESP32_S3.h"
#elif defined(CONFIG_IDF_TARGET_ESP32)
#include "Processors/TFT_eSPI_ESP32.h"
#else
#pragma GCC error "Бібліотека може працювати тільки на мікроконтролері esp32 або esp32s3"
#endif

/***************************************************************************************
**                         Section 3: Interface setup
***************************************************************************************/
#ifndef TAB_COLOUR
#define TAB_COLOUR 0
#endif

// If the SPI frequency is not defined, set a default
#ifndef SPI_FREQUENCY
#define SPI_FREQUENCY 20000000
#endif

// If the SPI read frequency is not defined, set a default
#ifndef SPI_READ_FREQUENCY
#define SPI_READ_FREQUENCY 10000000
#endif

// Some ST7789 boards do not work with Mode 0
#ifndef TFT_SPI_MODE
#if defined(ST7789_DRIVER) || defined(ST7789_2_DRIVER)
#define TFT_SPI_MODE SPI_MODE3
#else
#define TFT_SPI_MODE SPI_MODE0
#endif
#endif

// If the XPT2046 SPI frequency is not defined, set a default
#ifndef SPI_TOUCH_FREQUENCY
#define SPI_TOUCH_FREQUENCY 2500000
#endif

#ifndef SPI_BUSY_CHECK
#define SPI_BUSY_CHECK
#endif

// If half duplex SDA mode is defined then MISO pin should be -1
#ifdef TFT_SDA_READ
#ifdef TFT_MISO
#if TFT_MISO != -1
#undef TFT_MISO
#define TFT_MISO -1
#warning TFT_MISO set to -1
#endif
#endif
#endif

/***************************************************************************************
**                         Section 4: Setup fonts
***************************************************************************************/

// Only load the fonts defined in User_Setup.h (to save space)
// Set flag so RLE rendering code is optionally compiled
#ifdef LOAD_FONT2
#include "./Fonts/Font2.c"
#endif

#ifdef LOAD_FONT4
#include "./Fonts/Font4.c"
#endif

// Create a null default font in case some fonts not used (to prevent crash)
const uint8_t widtbl_null[1] = {0};
PROGMEM const uint8_t chr_null[1] = {0};
PROGMEM const uint8_t *const chrtbl_null[1] = {chr_null};

// This is a structure to conveniently hold information on the default fonts
// Stores pointer to font character image address table, width table and height
typedef struct
{
  const uint8_t *chartbl;
  const uint8_t *widthtbl;
  uint8_t height;
  uint8_t baseline;
} fontinfo;

// Now fill the structure
const PROGMEM fontinfo fontdata[] = {
    {(const uint8_t *)chrtbl_null, widtbl_null, 0, 0},
    {(const uint8_t *)chrtbl_null, widtbl_null, 8, 7},
#ifdef LOAD_FONT2
    {(const uint8_t *)chrtbl_f2, widtbl_f2, chr_hgt_font2, baseline_f2},
#else
    {(const uint8_t *)chrtbl_null, widtbl_null, 0, 0},
#endif
    {(const uint8_t *)chrtbl_null, widtbl_null, 0, 0},
#ifdef LOAD_FONT4
    {(const uint8_t *)chrtbl_f4, widtbl_f4, chr_hgt_font4, baseline_f4},
#else
    {(const uint8_t *)chrtbl_null, widtbl_null, 0, 0},
#endif
};

/***************************************************************************************
**                         Section 5: Font datum enumeration
***************************************************************************************/
// These enumerate the text plotting alignment (reference datum point)
#define TL_DATUM 0    // Top left (default)
#define TC_DATUM 1    // Top centre
#define TR_DATUM 2    // Top right
#define ML_DATUM 3    // Middle left
#define CL_DATUM 3    // Centre left, same as above
#define MC_DATUM 4    // Middle centre
#define CC_DATUM 4    // Centre centre, same as above
#define MR_DATUM 5    // Middle right
#define CR_DATUM 5    // Centre right, same as above
#define BL_DATUM 6    // Bottom left
#define BC_DATUM 7    // Bottom centre
#define BR_DATUM 8    // Bottom right
#define L_BASELINE 9  // Left character baseline (Line the 'A' character would sit on)
#define C_BASELINE 10 // Centre character baseline
#define R_BASELINE 11 // Right character baseline

/***************************************************************************************
**                         Section 6: Colour enumeration
***************************************************************************************/
// Default color definitions
#define TFT_BLACK 0x0000     /*   0,   0,   0 */
#define TFT_NAVY 0x000F      /*   0,   0, 128 */
#define TFT_DARKGREEN 0x03E0 /*   0, 128,   0 */
#define TFT_DARKCYAN 0x03EF  /*   0, 128, 128 */
#define TFT_MAROON 0x7800    /* 128,   0,   0 */
#define TFT_PURPLE 0x780F    /* 128,   0, 128 */
#define TFT_OLIVE 0x7BE0     /* 128, 128,   0 */
#define TFT_LIGHTGREY 0xD69A /* 211, 211, 211 */
#define TFT_LIME 0xA7E0
#define TFT_DARKGREY 0x3186
#define TFT_BLUE 0x001F                     /*   0,   0, 255 */
#define TFT_GREEN 0x07E0                    /*   0, 255,   0 */
#define TFT_CYAN 0x07FF                     /*   0, 255, 255 */
#define TFT_RED 0xF800                      /* 255,   0,   0 */
#define TFT_MAGENTA 0xF81F                  /* 255,   0, 255 */
#define TFT_YELLOW 0xFFE0                   /* 255, 255,   0 */
#define TFT_WHITE 0xFFFF                    /* 255, 255, 255 */
#define TFT_ORANGE 0xFDA0                   /* 255, 180,   0 */
#define TFT_GREENYELLOW 0xB7E0              /* 180, 255,   0 */
#define TFT_PINK 0xFE19 /* 255, 192, 203 */ // Lighter pink, was 0xFC9F
#define TFT_BROWN 0x9A60                    /* 150,  75,   0 */
#define TFT_GOLD 0xFEA0                     /* 255, 215,   0 */
#define TFT_SILVER 0xC618                   /* 192, 192, 192 */
#define TFT_SKYBLUE 0x867D                  /* 135, 206, 235 */
#define TFT_VIOLET 0x915C                   /* 180,  46, 226 */

#define TFT_TRANSPARENT 0xF81F // Колір rgb(255, 0, 255)

// Default palette for 4 bit colour sprites
const uint16_t default_4bit_palette[] PROGMEM = {
    TFT_BLACK,     //  0  ^
    TFT_BROWN,     //  1  |
    TFT_RED,       //  2  |
    TFT_ORANGE,    //  3  |
    TFT_YELLOW,    //  4  Colours 0-9 follow the resistor colour code!
    TFT_GREEN,     //  5  |
    TFT_BLUE,      //  6  |
    TFT_PURPLE,    //  7  |
    TFT_DARKGREY,  //  8  |
    TFT_WHITE,     //  9  v
    TFT_CYAN,      // 10  Blue+green mix
    TFT_MAGENTA,   // 11  Blue+red mix
    TFT_MAROON,    // 12  Darker red colour
    TFT_DARKGREEN, // 13  Darker green colour
    TFT_NAVY,      // 14  Darker blue colour
    TFT_PINK       // 15
};

/***************************************************************************************
**                         Section 7: Diagnostic support
***************************************************************************************/
// #define TFT_eSPI_DEBUG     // Switch on debug support serial messages  (not used yet)
// #define TFT_eSPI_FNx_DEBUG // Switch on debug support for function "x" (not used yet)

// Clipping macro for pushImage
#define PI_CLIP                   \
  if (_vpOoB)                     \
    return;                       \
  x += _xDatum;                   \
  y += _yDatum;                   \
                                  \
  if ((x >= _vpW) || (y >= _vpH)) \
    return;                       \
                                  \
  int32_t dx = 0;                 \
  int32_t dy = 0;                 \
  int32_t dw = w;                 \
  int32_t dh = h;                 \
                                  \
  if (x < _vpX)                   \
  {                               \
    dx = _vpX - x;                \
    dw -= dx;                     \
    x = _vpX;                     \
  }                               \
  if (y < _vpY)                   \
  {                               \
    dy = _vpY - y;                \
    dh -= dy;                     \
    y = _vpY;                     \
  }                               \
                                  \
  if ((x + dw) > _vpW)            \
    dw = _vpW - x;                \
  if ((y + dh) > _vpH)            \
    dh = _vpH - y;                \
                                  \
  if (dw < 1 || dh < 1)           \
    return;

/***************************************************************************************
**                         Section 8: Class member and support functions
***************************************************************************************/

// Callback prototype for smooth font pixel colour read
typedef uint16_t (*getColorCallback)(uint16_t x, uint16_t y);

// Class functions and variables
class TFT_eSPI
{
  friend class TFT_eSprite; // Sprite class has access to protected members

  //--------------------------------------- public ------------------------------------//
public:
  explicit TFT_eSPI(int16_t _W = TFT_WIDTH, int16_t _H = TFT_HEIGHT);

  // init() and begin() are equivalent, begin() included for backwards compatibility
  // Sketch defined tab colour option is for ST7735 displays only
  void init(uint8_t tc = TAB_COLOUR), begin(uint8_t tc = TAB_COLOUR);

  // These are virtual so the TFT_eSprite class can override them with sprite specific functions
  virtual void drawPixel(int32_t x, int32_t y, uint32_t color),
      drawChar(int32_t x, int32_t y, uint16_t c, uint32_t color, uint32_t bg, uint8_t size),
      drawLine(int32_t xs, int32_t ys, int32_t xe, int32_t ye, uint32_t color),
      drawFastVLine(int32_t x, int32_t y, int32_t h, uint32_t color),
      drawFastHLine(int32_t x, int32_t y, int32_t w, uint32_t color),
      fillRect(int32_t x, int32_t y, int32_t w, int32_t h, uint32_t color);

  virtual int16_t drawChar(uint16_t uniCode, int32_t x, int32_t y, uint8_t font);
  virtual int16_t drawChar(uint16_t uniCode, int32_t x, int32_t y);

  virtual int16_t height(void);
  virtual int16_t width(void);

