Kolodieiev/perfect_console/firmware/esp32s3_fw/src/meow/driver/graphics/TFT_eSPI/TFT_eSPI.h
  // Read the colour of a pixel at x,y and return value in 565 format
  virtual uint16_t readPixel(int32_t x, int32_t y);

  virtual void setWindow(int32_t xs, int32_t ys, int32_t xe, int32_t ye); // Note: start + end coordinates

  // Push (aka write pixel) colours to the set window
  virtual void pushColor(uint16_t color);

  // These are non-inlined to enable override
  virtual void begin_nin_write();
  virtual void end_nin_write();

  void setRotation(uint8_t r); // Set the display image orientation to 0, 1, 2 or 3
  uint8_t getRotation(void);   // Read the current rotation

  // Change the origin position from the default top left
  // Note: setRotation, setViewport and resetViewport will revert origin to top left corner of screen/sprite
  void setOrigin(int32_t x, int32_t y);
  int32_t getOriginX(void);
  int32_t getOriginY(void);

  void invertDisplay(bool i); // Tell TFT to invert all displayed colours

  // The TFT_eSprite class inherits the following functions (not all are useful to Sprite class
  void setAddrWindow(int32_t xs, int32_t ys, int32_t w, int32_t h); // Note: start coordinates + width and height

  // Viewport commands, see "Viewport_Demo" sketch
  void setViewport(int32_t x, int32_t y, int32_t w, int32_t h, bool vpDatum = true);
  bool checkViewport(int32_t x, int32_t y, int32_t w, int32_t h);
  int32_t getViewportX(void);
  int32_t getViewportY(void);
  int32_t getViewportWidth(void);
  int32_t getViewportHeight(void);
  bool getViewportDatum(void);
  void frameViewport(uint16_t color, int32_t w);
  void resetViewport(void);

  // Clip input window to viewport bounds, return false if whole area is out of bounds
  bool clipAddrWindow(int32_t *x, int32_t *y, int32_t *w, int32_t *h);
  // Clip input window area to viewport bounds, return false if whole area is out of bounds
  bool clipWindow(int32_t *xs, int32_t *ys, int32_t *xe, int32_t *ye);

  // Push (aka write pixel) colours to the TFT (use setAddrWindow() first)
  void pushColor(uint16_t color, uint32_t len),                   // Deprecated, use pushBlock()
      pushColors(uint16_t *data, uint32_t len, bool swap = true), // With byte swap option
      pushColors(uint8_t *data, uint32_t len);                    // Deprecated, use pushPixels()

  // Write a solid block of a single colour
  void pushBlock(uint16_t color, uint32_t len);

  // Write a set of pixels stored in memory, use setSwapBytes(true/false) function to correct endianess
  void pushPixels(const void *data_in, uint32_t len);

// Support for half duplex (bi-directional SDA) SPI bus where MOSI must be switched to input
#ifdef TFT_SDA_READ
#if defined(TFT_eSPI_ENABLE_8_BIT_READ)
  uint8_t tft_Read_8(void); // Read 8 bit value from TFT command register
#endif
  void begin_SDA_Read(void); // Begin a read on a half duplex (bi-directional SDA) SPI bus - sets MOSI to input
  void end_SDA_Read(void);   // Restore MOSI to output
#endif

  // Graphics drawing
  void fillScreen(uint32_t color),
      drawRect(int32_t x, int32_t y, int32_t w, int32_t h, uint32_t color),
      drawRoundRect(int32_t x, int32_t y, int32_t w, int32_t h, int32_t radius, uint32_t color),
      fillRoundRect(int32_t x, int32_t y, int32_t w, int32_t h, int32_t radius, uint32_t color);

  void fillRectVGradient(int16_t x, int16_t y, int16_t w, int16_t h, uint32_t color1, uint32_t color2);
  void fillRectHGradient(int16_t x, int16_t y, int16_t w, int16_t h, uint32_t color1, uint32_t color2);

  void drawCircle(int32_t x, int32_t y, int32_t r, uint32_t color),
      drawCircleHelper(int32_t x, int32_t y, int32_t r, uint8_t cornername, uint32_t color),
      fillCircle(int32_t x, int32_t y, int32_t r, uint32_t color),
      fillCircleHelper(int32_t x, int32_t y, int32_t r, uint8_t cornername, int32_t delta, uint32_t color),

      drawEllipse(int16_t x, int16_t y, int32_t rx, int32_t ry, uint16_t color),
      fillEllipse(int16_t x, int16_t y, int32_t rx, int32_t ry, uint16_t color),

      //                 Corner 1               Corner 2               Corner 3
      drawTriangle(int32_t x0, int32_t y0, int32_t x1, int32_t y1, int32_t x2, int32_t y2, uint32_t color),
      fillTriangle(int32_t x0, int32_t y0, int32_t x1, int32_t y1, int32_t x2, int32_t y2, uint32_t color);

  // Smooth (anti-aliased) graphics drawing
  // Draw a pixel blended with the background pixel colour (bg_color) specified,  return blended colour
  // If the bg_color is not specified, the background pixel colour will be read from TFT or sprite
  uint16_t drawPixel(int32_t x, int32_t y, uint32_t color, uint8_t alpha, uint32_t bg_color = 0x00FFFFFF);

  // Draw an anti-aliased (smooth) arc between start and end angles. Arc ends are anti-aliased.
  // By default the arc is drawn with square ends unless the "roundEnds" parameter is included and set true
  // Angle = 0 is at 6 o'clock position, 90 at 9 o'clock etc. The angles must be in range 0-360 or they will be clipped to these limits
  // The start angle may be larger than the end angle. Arcs are always drawn clockwise from the start angle.
  void drawSmoothArc(int32_t x, int32_t y, int32_t r, int32_t ir, uint32_t startAngle, uint32_t endAngle, uint32_t fg_color, uint32_t bg_color, bool roundEnds = false);

  // As per "drawSmoothArc" except the ends of the arc are NOT anti-aliased, this facilitates dynamic arc length changes with
  // arc segments and ensures clean segment joints.
  // The sides of the arc are anti-aliased by default. If smoothArc is false sides will NOT be anti-aliased
  void drawArc(int32_t x, int32_t y, int32_t r, int32_t ir, uint32_t startAngle, uint32_t endAngle, uint32_t fg_color, uint32_t bg_color, bool smoothArc = true);

  // Draw an anti-aliased filled circle at x, y with radius r
  // Note: The thickness of line is 3 pixels to reduce the visible "braiding" effect of anti-aliasing narrow lines
  //       this means the inner anti-alias zone is always at r-1 and the outer zone at r+1
  void drawSmoothCircle(int32_t x, int32_t y, int32_t r, uint32_t fg_color, uint32_t bg_color);

  // Draw an anti-aliased filled circle at x, y with radius r
  // If bg_color is not included the background pixel colour will be read from TFT or sprite
  void fillSmoothCircle(int32_t x, int32_t y, int32_t r, uint32_t color, uint32_t bg_color = 0x00FFFFFF);

