Kolodieiev/perfect_console/firmware/esp32s3_fw/src/meow/driver/graphics/TFT_eSPI/TFT_eSPI.h
  // Draw a rounded rectangle that has a line thickness of r-ir+1 and bounding box defined by x,y and w,h
  // The outer corner radius is r, inner corner radius is ir
  // The inside and outside of the border are anti-aliased
  void drawSmoothRoundRect(int32_t x, int32_t y, int32_t r, int32_t ir, int32_t w, int32_t h, uint32_t fg_color, uint32_t bg_color = 0x00FFFFFF, uint8_t quadrants = 0xF);

  // Draw a filled rounded rectangle , corner radius r and bounding box defined by x,y and w,h
  void fillSmoothRoundRect(int32_t x, int32_t y, int32_t w, int32_t h, int32_t radius, uint32_t color, uint32_t bg_color = 0x00FFFFFF);

  // Draw a small anti-aliased filled circle at ax,ay with radius r (uses drawWideLine)
  // If bg_color is not included the background pixel colour will be read from TFT or sprite
  void drawSpot(float ax, float ay, float r, uint32_t fg_color, uint32_t bg_color = 0x00FFFFFF);

  // Draw an anti-aliased wide line from ax,ay to bx,by width wd with radiused ends (radius is wd/2)
  // If bg_color is not included the background pixel colour will be read from TFT or sprite
  void drawWideLine(float ax, float ay, float bx, float by, float wd, uint32_t fg_color, uint32_t bg_color = 0x00FFFFFF);

  // Draw an anti-aliased wide line from ax,ay to bx,by with different width at each end aw, bw and with radiused ends
  // If bg_color is not included the background pixel colour will be read from TFT or sprite
  void drawWedgeLine(float ax, float ay, float bx, float by, float aw, float bw, uint32_t fg_color, uint32_t bg_color = 0x00FFFFFF);

  // Image rendering
  // Swap the byte order for pushImage() and pushPixels() - corrects endianness
  void setSwapBytes(bool swap);
  bool getSwapBytes(void);

  // Draw bitmap
  void drawBitmap(int16_t x, int16_t y, const uint8_t *bitmap, int16_t w, int16_t h, uint16_t fgcolor),
      drawBitmap(int16_t x, int16_t y, const uint8_t *bitmap, int16_t w, int16_t h, uint16_t fgcolor, uint16_t bgcolor),
      drawXBitmap(int16_t x, int16_t y, const uint8_t *bitmap, int16_t w, int16_t h, uint16_t fgcolor),
      drawXBitmap(int16_t x, int16_t y, const uint8_t *bitmap, int16_t w, int16_t h, uint16_t fgcolor, uint16_t bgcolor),
      setBitmapColor(uint16_t fgcolor, uint16_t bgcolor); // Define the 2 colours for 1bpp sprites

  // Set TFT pivot point (use when rendering rotated sprites)
  void setPivot(int16_t x, int16_t y);
  int16_t getPivotX(void), // Get pivot x
      getPivotY(void);     // Get pivot y

  // The next functions can be used as a pair to copy screen blocks (or horizontal/vertical lines) to another location
  // Read a block of pixels to a data buffer, buffer is 16 bit and the size must be at least w * h
  void readRect(int32_t x, int32_t y, int32_t w, int32_t h, uint16_t *data);
  // Write a block of pixels to the screen which have been read by readRect()
  void pushRect(int32_t x, int32_t y, int32_t w, int32_t h, uint16_t *data);

  // These are used to render images or sprites stored in RAM arrays (used by Sprite class for 16bpp Sprites)
  void pushImage(int32_t x, int32_t y, int32_t w, int32_t h, uint16_t *data);
  void pushImage(int32_t x, int32_t y, int32_t w, int32_t h, uint16_t *data, uint16_t transparent);

  // These are used to render images stored in FLASH (PROGMEM)
  void pushImage(int32_t x, int32_t y, int32_t w, int32_t h, const uint16_t *data, uint16_t transparent);
  void pushImage(int32_t x, int32_t y, int32_t w, int32_t h, const uint16_t *data);

  // These are used by Sprite class pushSprite() member function for 1, 4 and 8 bits per pixel (bpp) colours
  // They are not intended to be used with user sketches (but could be)
  // Set bpp8 true for 8bpp sprites, false otherwise. The cmap pointer must be specified for 4bpp
  void pushImage(int32_t x, int32_t y, int32_t w, int32_t h, uint8_t *data, bool bpp8 = true, uint16_t *cmap = nullptr);
  void pushImage(int32_t x, int32_t y, int32_t w, int32_t h, uint8_t *data, uint8_t transparent, bool bpp8 = true, uint16_t *cmap = nullptr);
  // FLASH version
  void pushImage(int32_t x, int32_t y, int32_t w, int32_t h, const uint8_t *data, bool bpp8, uint16_t *cmap = nullptr);

  // Render a 16 bit colour image with a 1bpp mask
  void pushMaskedImage(int32_t x, int32_t y, int32_t w, int32_t h, uint16_t *img, uint8_t *mask);

  // This next function has been used successfully to dump the TFT screen to a PC for documentation purposes
  // It reads a screen area and returns the 3 RGB 8 bit colour values of each pixel in the buffer
  // Set w and h to 1 to read 1 pixel's colour. The data buffer must be at least w * h * 3 bytes
  void readRectRGB(int32_t x, int32_t y, int32_t w, int32_t h, uint8_t *data);

  // Text rendering - value returned is the pixel width of the rendered text
  int16_t drawNumber(long intNumber, int32_t x, int32_t y, uint8_t font), // Draw integer using specified font number
      drawNumber(long intNumber, int32_t x, int32_t y),                   // Draw integer using current font

      // Decimal is the number of decimal places to render
      // Use with setTextDatum() to position values on TFT, and setTextPadding() to blank old displayed values
      drawFloat(float floatNumber, uint8_t decimal, int32_t x, int32_t y, uint8_t font), // Draw float using specified font number
      drawFloat(float floatNumber, uint8_t decimal, int32_t x, int32_t y),               // Draw float using current font

      // Handle char arrays
      // Use with setTextDatum() to position string on TFT, and setTextPadding() to blank old displayed strings
      drawString(const char *string, int32_t x, int32_t y, uint8_t font),   // Draw string using specified font number
      drawString(const char *string, int32_t x, int32_t y),                 // Draw string using current font
      drawString(const String &string, int32_t x, int32_t y, uint8_t font), // Draw string using specified font number
      drawString(const String &string, int32_t x, int32_t y),               // Draw string using current font

      drawCentreString(const char *string, int32_t x, int32_t y, uint8_t font),   // Deprecated, use setTextDatum() and drawString()
      drawRightString(const char *string, int32_t x, int32_t y, uint8_t font),    // Deprecated, use setTextDatum() and drawString()
      drawCentreString(const String &string, int32_t x, int32_t y, uint8_t font), // Deprecated, use setTextDatum() and drawString()
      drawRightString(const String &string, int32_t x, int32_t y, uint8_t font);  // Deprecated, use setTextDatum() and drawString()

