Kolodieiev/perfect_console/firmware/esp32s3_fw/src/meow/driver/graphics/TFT_eSPI/TFT_eSPI.h
  // Text rendering and font handling support funtions
  void setCursor(int16_t x, int16_t y),              // Set cursor for tft.print()
      setCursor(int16_t x, int16_t y, uint8_t font); // Set cursor and font number for tft.print()

  int16_t getCursorX(void), // Read current cursor x position (moves with tft.print())
      getCursorY(void);     // Read current cursor y position

  void setTextColor(uint16_t color),                                         // Set character (glyph) color only (background not over-written)
      setTextColor(uint16_t fgcolor, uint16_t bgcolor, bool bgfill = false), // Set character (glyph) foreground and background colour, optional background fill for smooth fonts
      setTextSize(uint8_t size);                                             // Set character size multiplier (this increases pixel size)

  void setTextWrap(bool wrapX, bool wrapY = false); // Turn on/off wrapping of text in TFT width and/or height

  void setTextDatum(uint8_t datum); // Set text datum position (default is top left), see Section 6 above
  uint8_t getTextDatum(void);

  void setTextPadding(uint16_t x_width); // Set text padding (background blanking/over-write) width in pixels
  uint16_t getTextPadding(void);         // Get text padding

  void setFreeFont(uint8_t font), // Not used, historical fix to prevent an error
      setTextFont(uint8_t font);  // Set the font number to use in future

  int16_t textWidth(const char *string, uint8_t font), // Returns pixel width of string in specified font
      textWidth(const char *string),                   // Returns pixel width of string in current font
      textWidth(const String &string, uint8_t font),   // As above for String types
      textWidth(const String &string),
      fontHeight(int16_t font), // Returns pixel height of string in specified font
      fontHeight(void);         // Returns pixel width of string in current font

  // Used by library and Smooth font class to extract Unicode point codes from a UTF8 encoded string
  uint32_t decodeUTF8(const uint8_t *buf, uint16_t &byte_pos, uint16_t remaining);

  // Used by Smooth font class to fetch a pixel colour for the anti-aliasing
  void setCallback(getColorCallback getCol);

  uint16_t fontsLoaded(void); // Each bit in returned value represents a font type that is loaded - used for debug/error handling only

  // Low level read/write
  void spiwrite(uint8_t); // legacy support only
#ifdef RM68120_DRIVER
  void writecommand(uint16_t c);                // Send a 16 bit command, function resets DC/RS high ready for data
  void writeRegister8(uint16_t c, uint8_t d);   // Write 8 bit data data to 16 bit command register
  void writeRegister16(uint16_t c, uint16_t d); // Write 16 bit data data to 16 bit command register
#else
  void writecommand(uint8_t c); // Send an 8 bit command, function resets DC/RS high ready for data
#endif
  void writedata(uint8_t d); // Send data with DC/RS set high

  void commandList(const uint8_t *addr); // Send a initialisation sequence to TFT stored in FLASH

  uint8_t readcommand8(uint8_t cmd_function, uint8_t index = 0);   // read 8 bits from TFT
  uint16_t readcommand16(uint8_t cmd_function, uint8_t index = 0); // read 16 bits from TFT
  uint32_t readcommand32(uint8_t cmd_function, uint8_t index = 0); // read 32 bits from TFT

  // Colour conversion
  // Convert 8 bit red, green and blue to 16 bits
  uint16_t color565(uint8_t red, uint8_t green, uint8_t blue);

  // Convert 8 bit colour to 16 bits
  uint16_t color8to16(uint8_t color332);
  // Convert 16 bit colour to 8 bits
  uint8_t color16to8(uint16_t color565);

  // Convert 16 bit colour to/from 24 bit, R+G+B concatenated into LS 24 bits
  uint32_t color16to24(uint16_t color565);
  uint32_t color24to16(uint32_t color888);

  // Alpha blend 2 colours, see generic "alphaBlend_Test" example
  // alpha =   0 = 100% background colour
  // alpha = 255 = 100% foreground colour
  uint16_t alphaBlend(uint8_t alpha, uint16_t fgc, uint16_t bgc);
  // 16 bit colour alphaBlend with alpha dither (dither reduces colour banding)
  uint16_t alphaBlend(uint8_t alpha, uint16_t fgc, uint16_t bgc, uint8_t dither);
  // 24 bit colour alphaBlend with optional alpha dither
  uint32_t alphaBlend24(uint8_t alpha, uint32_t fgc, uint32_t bgc, uint8_t dither = 0);

  // Direct Memory Access (DMA) support functions
  // These can be used for SPI writes when using the ESP32 (original) or STM32 processors.
  // DMA also works on a RP2040 processor with PIO based SPI and parallel (8 and 16 bit) interfaces
  // Bear in mind DMA will only be of benefit in particular circumstances and can be tricky
  // to manage by noobs. The functions have however been designed to be noob friendly and
  // avoid a few DMA behaviour "gotchas".
  //
  // At best you will get a 2x TFT rendering performance improvement when using DMA because
  // this library handles the SPI bus so efficiently during normal (non DMA) transfers. The best
  // performance improvement scenario is the DMA transfer time is exactly the same as the time it
  // takes for the processor to prepare the next image buffer and initiate another DMA transfer.
  //
  // DMA transfer to the TFT is done while the processor moves on to handle other tasks. Bear
  // this in mind and watch out for "gotchas" like the image buffer going out of scope as the
  // processor leaves a function or its content being changed while the DMA engine is reading it.
  //
  // The compiler MAY change the implied scope of a buffer which has been set aside by creating
  // an array. For example a buffer defined before a "for-next" loop may get de-allocated when
  // the loop ends. To avoid this use, for example, malloc() and free() to take control of when
  // the buffer space is available and ensure it is not released until DMA is complete.
  //
  // Clearly you should not modify a buffer that is being DMA'ed to the TFT until the DMA is over.
  // Use the dmaBusy() function to check this.  Use tft.startWrite() before invoking DMA so the
  // TFT chip select stays low. If you use tft.endWrite() before DMA is complete then the endWrite
  // function will wait for the DMA to complete, so this may defeat any DMA performance benefit.
  //

  bool initDMA(bool ctrl_cs = false); // Initialise the DMA engine and attach to SPI bus - typically used in setup()
                                      // Parameter "true" enables DMA engine control of TFT chip select (ESP32 only)
                                      // For ESP32 only, TFT reads will not work if parameter is true
  void deInitDMA(void);               // De-initialise the DMA engine and detach from SPI bus - typically not used

  // Push an image to the TFT using DMA, buffer is optional and grabs (double buffers) a copy of the image
  // Use the buffer if the image data will get over-written or destroyed while DMA is in progress
  //
  // Note 1: If swapping colour bytes is defined, and the double buffer option is NOT used, then the bytes
  // in the original image buffer content will be byte swapped by the function before DMA is initiated.
  //
  // Note 2: If part of the image will be off screen or outside of a set viewport, then the the original
  // image buffer content will be altered to a correctly clipped image before DMA is initiated.
  //
  // The function will wait for the last DMA to complete if it is called while a previous DMA is still
  // in progress, this simplifies the sketch and helps avoid "gotchas".
  void pushImageDMA(int32_t x, int32_t y, int32_t w, int32_t h, uint16_t *data, uint16_t *buffer = nullptr);

#if defined(ESP32) // ESP32 only at the moment
                   // For case where pointer is a const and the image data must not be modified (clipped or byte swapped)
  void pushImageDMA(int32_t x, int32_t y, int32_t w, int32_t h, uint16_t const *data);
#endif
  // Push a block of pixels into a window set up using setAddrWindow()
  void pushPixelsDMA(uint16_t *image, uint32_t len);

  // Check if the DMA is complete - use while(tft.dmaBusy); for a blocking wait
  bool dmaBusy(void); // returns true if DMA is still in progress
  void dmaWait(void); // wait until DMA is complete

  bool DMA_Enabled = false; // Flag for DMA enabled state
  uint8_t spiBusyCheck = 0; // Number of ESP32 transfer buffers to check

  // Bare metal functions
  void startWrite(void);                         // Begin SPI transaction
  void writeColor(uint16_t color, uint32_t len); // Deprecated, use pushBlock()
  void endWrite(void);                           // End SPI transaction

  // Set/get an arbitrary library configuration attribute or option
  //       Use to switch ON/OFF capabilities such as UTF8 decoding - each attribute has a unique ID
  //       id = 0: reserved - may be used in future to reset all attributes to a default state
  //       id = 1: Turn on (a=true) or off (a=false) GLCD cp437 font character error correction
  //       id = 2: Turn on (a=true) or off (a=false) UTF8 decoding
  //       id = 3: Enable or disable use of ESP32 PSRAM (if available)
#define CP437_SWITCH 1
#define UTF8_SWITCH 2
#define PSRAM_ENABLE 3
  void setAttribute(uint8_t id = 0, uint8_t a = 0); // Set attribute value
  uint8_t getAttribute(uint8_t id = 0);             // Get attribute value

  // Global variables
  static SPIClass &getSPIinstance(void); // Get SPI class handle
  //--------------------------------------- private ------------------------------------//

