Kolodieiev/perfect_console/firmware/esp32s3_fw/src/meow/driver/graphics/TFT_eSPI/TFT_eSPI.h
private:
#if defined(ESP32_PARALLEL)
  // Lookup table for ESP32 parallel bus interface uses 1kbyte RAM,
  uint32_t xset_mask[256]; // Makes Sprite rendering test 33% faster, for slower macro equivalent
                           // see commented out #define set_mask(C) within TFT_eSPI_ESP32.h
#endif
  // Port and pin masks for control signals (ESP826 only) - TODO: remove need for this
  volatile uint32_t *dcport, *csport;
  getColorCallback getColor = nullptr; // Smooth font callback function pointer

private:
  uint32_t textcolor, textbgcolor; // Text foreground and background colours
  uint32_t bitmap_fg, bitmap_bg;   // Bitmap foreground (bit=1) and background (bit=0) colours
  uint32_t cspinmask, dcpinmask, wrpinmask, sclkpinmask;

#if defined(ESP32_PARALLEL)
  // Bit masks for ESP32 parallel bus interface
  uint32_t xclr_mask, xdir_mask; // Port set/clear and direction control masks
#endif

protected:
  int32_t _init_width, _init_height; // Display w/h as input, used by setRotation()
  int32_t _width, _height;           // Display w/h as modified by current rotation
  int32_t addr_row, addr_col;        // Window position - used to minimise window commands

  // Viewport variables
  int32_t _vpX, _vpY, _vpW, _vpH; // Note: x start, y start, x end + 1, y end + 1
  int32_t _xDatum;
  int32_t _yDatum;
  int32_t _xWidth;
  int32_t _yHeight;

  int32_t cursor_x, cursor_y, padX; // Text cursor x,y and padding setting
  int32_t bg_cursor_x;              // Background fill cursor
  int32_t last_cursor_x;            // Previous text cursor position when fill used

  uint32_t fontsloaded; // Bit field of fonts loaded
  uint32_t _lastColor;  // Buffered value of last colour used

private:
  uint16_t decoderBuffer; // Unicode code-point buffer - not for user access

#if defined(SSD1963_DRIVER)
  uint16_t Cswap; // Swap buffer for SSD1963
#endif

protected:
  int16_t _xPivot; // TFT x pivot point coordinate for rotated Sprites
  int16_t _yPivot; // TFT x pivot point coordinate for rotated Sprites

private:
  uint8_t textfont, // Current selected font number
      textsize,     // Current font size multiplier
      textdatum,    // Text reference datum
      rotation;     // Display rotation (0-3)

  uint8_t decoderState = 0; // UTF8 decoder state - not for user access
  // Display variant settings
  uint8_t tabcolor = 0,           // ST7735 screen protector "tab" colour (now invalid)
      colstart = 0, rowstart = 0; // Screen display area to CGRAM area coordinate offsets

#if defined(SSD1963_DRIVER)
  uint8_t r6, g6, b6; // RGB buffer for SSD1963
#endif

private:
  bool locked, inTransaction, lockTransaction; // SPI transaction and mutex lock flags

protected:
  bool _vpDatum;
  bool _vpOoB;
  bool isDigits;             // adjust bounding box for numbers to reduce visual jiggling
  bool textwrapX, textwrapY; // If set, 'wrap' text at right and optionally bottom edge of display
  bool _swapBytes;           // Swap the byte order for TFT pushImage()
  bool _booted;              // init() or begin() has already run once
  // User sketch manages these via set/getAttribute()
  bool _cp437;        // If set, use correct CP437 charset (default is ON)
  bool _utf8;         // If set, use UTF-8 decoder in print stream 'write()' function (default ON)
  bool _psram_enable; // Enable PSRAM use for library functions (TBD) and Sprites
  bool _fillbg;       // Fill background flag (just for for smooth fonts at the moment)

private:
  // Legacy begin and end prototypes - deprecated TODO: delete
  void spi_begin();
  void spi_end();

  void spi_begin_read();
  void spi_end_read();

  // New begin and end prototypes
  // begin/end a TFT write transaction
  // For SPI bus the transmit clock rate is set
  inline void begin_tft_write() __attribute__((always_inline));
  inline void end_tft_write() __attribute__((always_inline));

  // begin/end a TFT read transaction
  // For SPI bus: begin lowers SPI clock rate, end reinstates transmit clock rate
  inline void begin_tft_read() __attribute__((always_inline));
  inline void end_tft_read() __attribute__((always_inline));

  // Initialise the data bus GPIO and hardware interfaces
  void initBus(void);

  // Temporary  library development function  TODO: remove need for this
  void pushSwapBytePixels(const void *data_in, uint32_t len);

  // Same as setAddrWindow but exits with CGRAM in read mode
  void readAddrWindow(int32_t xs, int32_t ys, int32_t w, int32_t h);

  // Byte read prototype
  uint8_t readByte(void);

  // GPIO parallel bus input/output direction control
  void busDir(uint32_t mask, uint8_t mode);

  // Single GPIO input/output direction control
  void gpioMode(uint8_t gpio, uint8_t mode);

  // Smooth graphics helper
  uint8_t sqrt_fraction(uint32_t num);

  // Helper function: calculate distance of a point from a finite length line between two points
  float wedgeLineDistance(float pax, float pay, float bax, float bay, float dr);

  /***************************************************************************************
  **                         Section 9: TFT_eSPI class conditional extensions
  ***************************************************************************************/
}; // End of class TFT_eSPI

// Swap any type
template <typename T>
static inline void
transpose(T &a, T &b)
{
  T t = a;
  a = b;
  b = t;
}

/***************************************************************************************
**                         Section 10: Additional extension classes
***************************************************************************************/
// Load the Sprite Class
#include "./TFT_eSprite.h"
